Repository: GamemakerChina/GmlSpec-CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: This function is a combination of the base draw_text() function with the draw_text_transformed() and draw_text_colour() functions, permitting you to scale and rotate text as well as colour it with a gradient fill and change its alpha value, ignoring the base alpha and colour settings for drawing.
zh_cn: 此函数是基础draw_text()函数与draw_text_transforms()和draw_text_color()函数的组合，允许您缩放和旋转文本，并使用渐变填充为其着色，并更改其alpha值，忽略绘图的基本alpha和颜色设置。

source: This function is a good way to test whether a timeline has passed the last active moment when running, since the timeline position will continue incrementing every step of the game whether there are further actions or not.
zh_cn: 此函数是测试运行时时间线是否已经过了最后一个活跃时刻的好方法，因为时间线的位置将在游戏的每一步继续增加，无论是否有进一步的动作。

source: This function is called when you want to begin the saving out of multiple buffers to multiple files.
zh_cn: 当您希望开始从多个缓冲区保存到多个文件时，将调用此函数。

source: This function is currently only useful for Google Play on the Android platform.
zh_cn: 此函数目前仅对Android平台上的谷歌Play有用。

source: This function is designed for creating JSON compatible maps which you would then encode using json_encode() and should only be used in conjunction with that functionality.
zh_cn: 此函数旨在创建JSON兼容的映射，然后使用json_encode()对其进行编码，并且只应与此函数结合使用。

source: This function is essential as a debug tool but it should be noted that it is very slow and only works when used in the draw event of the instance, and that you can set the draw alpha to change the opacity of the grid, permitting you to draw it as an overlay and see what is actually in the room at the same time.
zh_cn: 此函数作为一个调试工具是必不可少的，但是应该注意的是，它非常慢，并且只有在实例的draw事件中使用时才起作用，并且您可以设置draw alpha来改变网格的不透明度，允许您将它绘制为一个覆盖图，同时查看房间中实际上有什么。

source: This function is essential when working with surfaces due to their volatile nature.
zh_cn: 由于表面的易挥发性，此函数在处理表面时是必不可少的。

source: This function is extremely useful when debugging dynamic paths (for example, those created for instances with the mp_grid_path() function).
zh_cn: 此函数在调试动态路径时非常有用(例如，那些用mp_grid_path()函数为实例创建的路径)。

source: This function is for 2D (orthographic) projections only, and will not work correctly when a 3D camera projection is used.
zh_cn: 此函数仅适用于 2D（正交）投影，在使用 3D 相机投影时无法正常工作。

source: This function is for 2D projects only, and will not work correctly when a 3D camera projection is used.
zh_cn: 此函数仅适用于2D项目，当使用3D相机投影时将无法正常工作。

source: This function is for defining a directional light, where the direction and intensity are set by the values input for the x, y and z unit vector (meaning that they must be between -1 and 1, where 1 or -1 is full intensity, and 0 is no intensity).
zh_cn: 此函数用于定义方向光，其中方向和强度由x、y和z单位向量的输入值设置(意味着它们必须在-1和1之间，其中1或-1是全强度，0是无强度)。

source: This function is for defining a positional light, where you can define the x, y and z position of the light, the light range and its colour (which will also affect the perceived intensity of the light as certain colours appear "darker" than others).
zh_cn: 此函数是用来定义位置光的，在这里你可以定义光的x, y和z位置，光的范围和它的颜色(这也会影响光的感知强度，因为某些颜色看起来比其他颜色"更深")。

source: This function is for use with the Shader Functions and sets the MRT (0 - 3) for native level shaders (DX9, DX11, OpenGL).
zh_cn: 此函数与着色器函数一起使用，并设置本机级别着色器(DX9, DX11, OpenGL)的MRT(0 - 3)。

source: This function is global in scope, in that it will change the damping not just for new particles created after the change, but also for those already present in the simulation.
zh_cn: 此函数的作用范围是全局的，因为它不仅会为变化后产生的新粒子改变阻尼，还会为模拟中已经存在的粒子改变阻尼。

source: This function is global in scope, in that it will change the density not just for new particles created after the change, but also for those already present in the simulation.
zh_cn: 此函数在范围上是全局的，因为它不仅会更改更改后创建的新粒子的密度，还会更改模拟中已经存在的粒子的密度。

source: This function is global in scope, in that it will change the gravity scale not just for new particles created after the change, but also for those already present in the simulation.
zh_cn: 此函数在范围上是全局的，因为它不仅会更改更改后创建的新粒子的重力比例，还会更改模拟中已经存在的粒子的重力比例。

source: This function is global in scope, in that it will change the radius not just for new particles created after the change, but also for those already present in the simulation.
zh_cn: 此函数在范围上是全局的，因为它不仅会更改更改后创建的新粒子的半径，还会更改模拟中已经存在的粒子的半径。

source: This function is good for probabilities where returning an integer (whole number) is not necessary.
zh_cn: 此函数适用于不需要返回整数(整数)的概率。

source: This function is ideal for those effects that do not require any of the functionality offered by particle emitters (for example, to create smoke from a missile, or a simple explosion effect) as it permits you to quickly and easily create particles at any position in the game room.
zh_cn: 此函数非常适合那些不需要粒子发射器提供的任何功能的效果(例如，创建导弹烟雾或简单的爆炸效果)，因为它允许您在游戏房间的任何位置快速轻松地创建粒子。

source: This function is most useful when you are creating rooms dynamically using the function room_add(), but you can also use the read only variables room_first and room_last or the functions room_next() and room_previous() to get a specific room index, or provide a variable that has stored the index of any other room in your game.
zh_cn: 当你使用函数room_add()动态创建房间时，此函数是最有用的，但你也可以使用只读变量room_first和room_last或函数room_next()和room_previous()来获取特定的房间索引，或提供存储游戏中任何其他房间索引的变量。

source: This function is of particular interest to those that wish to create buttons and other interactive media outside of the GameMaker canvas element on their host page using the function clickable_add().
zh_cn: 对于那些希望使用clickable_add()函数在主机页面的GameMaker画布元素之外创建按钮和其他交互媒体的人来说，此函数特别有趣。

source: This function is of vital importance when creating save/load mechanisms for your game.
zh_cn: 在为你的游戏创建保存/加载机制时，此函数是至关重要的。

source: This function is only for use with instances which have sprites assigned to them created using the skeletal animation program Spine.
zh_cn: 此函数仅用于使用实例，这些实例使用骨骼动画程序Spine创建了分配给它们的精灵。

source: This function is only for use with sprites that have been created using a skeletal animation program like Spine.
zh_cn: 此函数仅用于使用使用骨骼动画程序(如Spine)创建的精灵。

source: This function is only for use with the buffer_save_async() function and you must also finish the save definition by calling buffer_async_group_end() function otherwise the files will not be saved out.
zh_cn: 此函数仅用于与buffer_save_async()函数一起使用，您还必须通过调用buffer_async_group_end()函数来完成保存定义，否则文件将不会被保存。

source: This function is only triggered once by the actual pressing action, and the constants listed on this page can be used to check for the mouse buttons.
zh_cn: 此函数仅由实际的按压动作触发一次，并且本页列出的常量可用于检查鼠标按键。

source: This function is only triggered once by the actual releasing action, and the constants listed on this page can be used to check for the mouse buttons.
zh_cn: 此函数只会被实际的释放动作触发一次，并且这个页面上列出的常量可以用来检查鼠标按钮。

source: This function is primarily for use within extensions, and allows you to set the "used" size of the given buffer, which is the number of bytes that have been written to it.
zh_cn: 此函数主要用于扩展中，允许您设置给定缓冲区的"已使用"大小，即已写入缓冲区的字节数。

source: This function is provided as a debug function and it is not recommended that you permit the end-user to do this in your games.
zh_cn: 此函数是作为调试功能提供的，不建议你允许最终用户在你的游戏中这样做。

source: This function is really only useful for extension writers who need the window handle to call Windows API's in DLL code (the returned pointer should be cast into a string and then in the C++ just cast it to an HWND).
zh_cn: 此函数实际上只对那些需要窗口句柄来在DLL代码中调用Windows API的扩展编写者有用(返回的指针应该转换为字符串，然后在c++中仅仅转换为HWND)。

source: This function is similar to random_range() only with integer values as the input.
zh_cn: 此函数类似于random_range()，只是输入的是整数值。

source: This function is similar to the log2(n) and log10(n) functions, only you stipulate the log base value.
zh_cn: 此函数类似于log2(n)和log10(n)函数，只是您规定了log的底值。

source: This function is similar to the log2(n) function, only that log10(n) gets the number of 10's that we need to multiply together to get n.
zh_cn: 此函数类似于log2(n)函数，只是log10(n)得到的是10的个数，我们需要将这些数相乘才能得到n。

source: This function is the same as the collision_circle() function, only instead of just detecting one instance in collision at a time, it will detect multiple instances.
zh_cn: 此函数与collision_circle()函数相同，只是它不是一次只检测一个碰撞实例，而是检测多个实例。

source: This function is the same as the collision_ellipse() function, only instead of just detecting one instance in collision at a time, it will detect multiple instances.
zh_cn: 此函数与collision_ellipse()函数相同，只是它不是一次只检测碰撞中的一个实例，而是检测多个实例。

source: This function is the same as the collision_line() function, only instead of just detecting one instance in collision at a time, it will detect multiple instances.
zh_cn: 此函数与collision_line()函数相同，只是它不是一次只检测一个碰撞实例，而是检测多个实例。

source: This function is the same as the collision_point() function, only instead of just detecting one instance in collision at a time, it will detect multiple instances.
zh_cn: 此函数与collision_point()函数相同，只是它不是一次只检测一个碰撞实例，而是检测多个实例。

source: This function is the same as the collision_rectangle() function, only instead of just detecting one instance in collision at a time, it will detect multiple instances.
zh_cn: 此函数与collision_rectangle()函数相同，只是它不是一次只检测一个碰撞实例，而是检测多个实例。

source: This function is the same as using the DS list accessor.
zh_cn: 此函数与使用DS list访问器相同。

source: This function is the same as using the DS map accessor to set/create a map key/value pair.
zh_cn: 此函数与使用DS map访问器设置/创建映射键/值对相同。

source: This function is used to "snap" the instance to a grid of a given size.
zh_cn: 此函数用于将实例"捕捉"到给定大小的网格。

source: This function is used to align text along the horizontal axis and changing the horizontal alignment will change the position and direction in which all further text is drawn with the default value being fa_left.
zh_cn: 此函数用于将文本沿水平轴对齐，改变水平对齐将改变所有后续文本绘制的位置和方向，默认值为fa_left。

source: This function is used to align text along the vertical axis and changing the vertical alignment will change the position and direction in which all further text is drawn, with the default value being fa_top.
zh_cn: 此函数用于沿垂直轴对齐文本，更改垂直对齐将更改所有后续文本绘制的位置和方向，默认值为fa_top。

source: This function is used to apply a Nine Slice struct to a sprite.
zh_cn: 此函数用于将九宫格结构应用到sprite。

source: This function is used to assign an FX struct to a Room Layer.
zh_cn: 此函数用于将FX结构分配给房间层。

source: This function is used to change the parameters of a filter/effect.
zh_cn: 此函数用于更改过滤器/效果的参数。

source: This function is used to change the resolution of the Windows thread scheduler.
zh_cn: 此函数用于改变Windows线程调度器的分辨率。

source: This function is used to change the value of a parameter in the given FX struct.
zh_cn: 此函数用于改变给定FX结构中的参数值。

source: This function is used to check if FX is enabled for a specified layer.
zh_cn: 此函数用于检查指定图层是否启用了FX。

source: This function is used to check whether tap counting is enabled or disabled.
zh_cn: 此函数用于检查tap计数是启用还是禁用。

source: This function is used to clear the FX struct that is applied to the specified layer.
zh_cn: 此函数用于清除应用于指定层的FX结构。

source: This function is used to close the video file and free up any memory associated with it.
zh_cn: 此函数用于关闭视频文件并释放与之相关的所有内存。

source: This function is used to control the ambient light of a scene, which is the light that you have in a scene even without having defined any point or directional light sources.
zh_cn: 此函数用来控制场景的环境光，它是你在场景中即使没有定义任何点或方向光源的光。

source: This function is used to create a new FX Struct for a given effect type, which contains information on the effect and the values for its parameters.
zh_cn: 此函数用于为给定的效果类型创建一个新的FX Struct，其中包含关于效果的信息及其参数值。

source: This function is used to create a new client socket for your game to communicate over the network.
zh_cn: 此函数用来为你的游戏创建一个新的客户端套接字，以便通过网络进行通信。

source: This function is used to create a new layer within the current room.
zh_cn: 此函数用于在当前房间内创建一个新层。

source: This function is used to create a new network server for your game, using one of the permitted connection protocols (see the constants listed below).
zh_cn: 此函数用来为你的游戏创建一个新的网络服务器，使用一个允许的连接协议(参见下面列出的常量)。

source: This function is used to create a new particle system and will return a unique index number that should be stored and used in all further functions relating to that system.
zh_cn: 此函数用于创建一个新的粒子系统，并将返回一个唯一的索引编号，该索编号应存储在与该系统相关的所有进一步函数中。

source: This function is used to create a new, empty, DS map and will return its id which is then used to access the data structure in all other DS map functions.
zh_cn: 此函数用于创建一个新的空DS map，并将返回它的id，然后用于访问所有其他DS map函数中的数据结构。

source: This function is used to create a surface and will return the index of the surface which should be stored in a variable for future function calls.
zh_cn: 此函数用于创建一个表面，并将返回该表面的索引，该索引应存储在一个变量中以供将来的函数调用。

source: This function is used to determine the direction of the particle when it is created and can also be used to make the particle increase or decrease its direction over its lifetime.
zh_cn: 此函数用于确定粒子创建时的方向，也可用于使粒子在其生命周期内增加或减少其方向。

source: This function is used to determine the orientation of the particle sprite when it is created and can also be used to make the particle orientation increase or decrease over its lifetime.
zh_cn: 这是控制指定类型的每个粒子在屏幕上停留多长时间的函数。

source: This function is used to determine the size of the particle when it is created and can also be used to make the particle increase or decrease in size over its lifetime.
zh_cn: 此函数用于确定粒子创建时的大小，也可用于使粒子在其生命周期内增大或减小大小。

source: This function is used to enable FX for a specified layer.
zh_cn: 此函数用于启用指定图层的FX。

source: This function is used to enable a defined light.
zh_cn: 此函数用于启用定义的灯。

source: This function is used to enable all lighting effects.
zh_cn: 此函数用于启用所有照明效果。

source: This function is used to enable player preferences and needs to be called before joining or creating a rollback game.
zh_cn: 此函数用于启用玩家偏好，需要在加入或创建回滚游戏前调用。

source: This function is used to end the definition of a particle group shape.
zh_cn: 此函数用于结束粒子组形状的定义。

source: This function is used to force a filter or effect onto a single layer.
zh_cn: 此函数用于将滤镜或效果强制应用到单个图层上。

source: This function is used to free up the memory associated with the given audio queue.
zh_cn: 此函数用来释放与给定音频队列相关的内存。

source: This function is used to get the angle which a pair of touches must exceed in order to trigger a Rotate Start Gesture.
zh_cn: 此函数用于获取一对触摸必须超过的角度，以触发旋转开始手势。

source: This function is used to get the angle within which a touch must be moving away from another touch before a Pinch Out Gesture may potentially be started.
zh_cn: 此函数用于获得在张开手势可能开始之前，一个触摸必须远离另一个触摸的角度。

source: This function is used to get the angle within which a touch must be moving towards another touch before a Pinch In Gesture may potentially be started.
zh_cn: 此函数用于获得一个触摸必须向另一个触摸移动的角度，在该角度内，手势中的收缩可能开始。

source: This function is used to get the distance it takes for a Dragging Gesture event to be triggered by the movement of a touch or click.
zh_cn: 此函数用于获取触摸或点击动作触发拖动手势事件所需的距离。

source: This function is used to get the distance within which you have to touch/click the screen again after a single tap in order to trigger a Double Tap Gesture.
zh_cn: 此函数用于获取点击一次后再次触摸/点击屏幕的距离，以触发双击手势。

source: This function is used to get the distance within which you have to touch/click the screen and move with two fingers before you trigger a Pinch Gesture.
zh_cn: 此函数用于获取在触发挤压手势之前，您必须用两个手指触摸/点击屏幕并移动的距离。

source: This function is used to get the preferences for a given player.
zh_cn: 此函数用于获取给定玩家的偏好。

source: This function is used to get the speed required for a Flick Gesture event to be triggered when a touch or click is released.
zh_cn: 此函数用于获取释放触摸或点击时触发轻击手势事件所需的速度。

source: This function is used to get the text alignment setting along the horizontal axis, and will return one of the constants listed below.
zh_cn: 此函数用于获得沿水平轴的文本对齐设置，并将返回下面列出的常量之一。

source: This function is used to get the text alignment setting along the vertical axis, and will return one of the constants listed below.
zh_cn: 此函数用于获得沿垂直轴的文本对齐设置，并将返回下面列出的常量之一。

source: This function is used to get the time it takes between two touches/clicks to trigger a Double Tap Gesture event.
zh_cn: 此函数用于获取两次触摸/点击之间触发双击手势事件所需的时间。

source: This function is used to get the time it takes for a Drag Start Gesture event to be triggered by a touch or click.
zh_cn: 此函数用于获取触摸或点击触发拖动开始手势事件所需的时间。

source: This function is used to get the x component of a position "len" pixels from the starting point and in direction "dir".
zh_cn: 此函数用于从起点和方向"dir"获得位置"len"像素的x分量。

source: This function is used to get the y component of a position "len" pixels from the starting point and in direction "dir".
zh_cn: 此函数用于从起点和方向"dir"获得位置"len"像素的y分量。

source: This function is used to load a buffer that was previously saved using the buffer_save() functions, as well as any Included Files or files loaded externally.
zh_cn: 此函数用于加载先前使用buffer_save()函数保存的缓冲区，以及任何包含的文件或外部加载的文件。

source: This function is used to perform any one of the Asynchronous Events provided in GameMaker.
zh_cn: 此函数用于执行GameMaker中提供的任何一个异步事件。

source: This function is used to reset the layer target to the current room.
zh_cn: 此函数用来重置图层目标到当前房间。

source: This function is used to retrieve a struct containing all the parameters for the given FX struct.
zh_cn: 此函数用于检索包含给定FX结构的所有参数的结构。

source: This function is used to retrieve information for the given sprite.
zh_cn: 此函数用于检索给定精灵的信息。

source: This function is used to retrieve information for the given tileset.
zh_cn: 此函数用于检索给定tileset的信息。

source: This function is used to retrieve information for the given font.
zh_cn: 此函数用于检索给定字体的信息。

source: This function is used to retrieve the FX struct for a layer.
zh_cn: 此函数用于检索层的FX结构。

source: This function is used to retrieve the name of a filter/effect from its struct.
zh_cn: 此函数用于从其结构中检索过滤器/效果的名称。

source: This function is used to retrieve the resolution of the Windows thread scheduler in milliseconds.
zh_cn: 此函数用于检索Windows线程计划程序的分辨率(以毫秒为单位)。

source: This function is used to retrieve the value of a parameter from an FX Struct.
zh_cn: 此函数用于从 FX 结构中检索参数的值。

source: This function is used to retrieve this ID by using the name (a string) of the layer (as written in the IDE).
zh_cn: 此函数通过使用层的名称(字符串)(在IDE中写入)来检索这个ID。

source: This function is used to set a particle type to be a single colour for the total duration of the lifetime of each individual particle.
zh_cn: 此函数用于将粒子类型设置为单个粒子生命周期的总持续时间内的单一颜色。

source: This function is used to set a particle type to have a single alpha value (transparency) for the total duration of the lifetime of each individual particle, and this can be from 0 (transparent) to 1 (opaque).
zh_cn: 此函数用于设置粒子类型，使每个粒子的生命周期的总持续时间只有一个alpha值(透明)，这个值可以从0(透明)到1(不透明)。

source: This function is used to set the angle which a pair of touches must exceed in order to trigger a Rotate Start Gesture.
zh_cn: 此函数用于设置一对触摸必须超过的角度，以触发旋转开始手势。

source: This function is used to set the angle within which a touch must be moving away from another touch before a Pinch Out Gesture may potentially be started.
zh_cn: 此函数用于设置在张开手势可能开始之前，一个触摸必须远离另一个触摸的角度。

source: This function is used to set the angle within which a touch must be moving towards another touch before a Pinch In Gesture may potentially be started.
zh_cn: 此函数用于设置一个触摸向另一个触摸移动的角度，在此角度范围内，手势中的收缩可能会开始。

source: This function is used to set the distance it takes for a Dragging Gesture event to be triggered by the movement of a touch or click.
zh_cn: 此函数用于设置触摸或点击的移动触发拖动手势事件所需的距离。

source: This function is used to set the distance within which you have to touch/click the screen again after a single tap in order to trigger a Double Tap Gesture.
zh_cn: 此函数用于设置在单次点击后，为了触发双击手势，你必须再次触摸/点击屏幕的距离。

source: This function is used to set the distance within which you have to touch/click the screen and move with two fingers before you trigger a Pinch Gesture.
zh_cn: 此函数用于设置在触发挤压手势之前，您必须用两个手指触摸/点击屏幕并移动的距离。

source: This function is used to set the movement speed of the particle when it is created and can also be used to make the particle increase or decrease its speed over its lifetime.
zh_cn: 此函数用于设置粒子创建时的移动速度，也可用于使粒子在其生命周期内增加或减少速度。

source: This function is used to set the speed required for a Flick Gesture event to be triggered when a touch or click is released.
zh_cn: 此函数用于设置释放触摸或点击时触发轻击手势事件所需的速度。

source: This function is used to set the time it takes between two touches/clicks to trigger a Double Tap Gesture event.
zh_cn: 此函数用来设置两次触摸/点击之间触发双击手势事件的时间间隔。

source: This function is used to set the time it takes for a Drag Gesture event to be triggered by a touch or click.
zh_cn: 此函数用于设置触摸或点击触发拖动手势事件所需的时间。

source: This function is used to set the time within which a pair of touches must be rotating in a consistent direction for a Rotate Start Gesture to be triggered.
zh_cn: 此函数用于设置一对触摸必须在一致的方向上旋转的时间，以触发旋转开始手势。

source: This function is used to set their position of a particle emitter within the current room.
zh_cn: 此函数用于设置粒子发射器在当前房间内的位置。

source: This function is used to set whether tap counting is enabled or disabled.
zh_cn: 此函数用于设置是否启用或禁用敲击计数。

source: This function is used to update the local player preferences.
zh_cn: 此函数用于更新本地玩家偏好。

source: This function is very useful to prevent the browser creating a pop-up window when clicking on the button as it is all done through GameMaker itself.
zh_cn: 此函数对于防止浏览器在点击按钮时弹出窗口非常有用，因为这一切都是通过GameMaker本身完成的。

source: This function iterates over each character of a string calling a provided function.
zh_cn: 此函数迭代调用所提供函数的字符串的每个字符。

source: This function joins a set of arguments using the provided delimiter, non-string values will be converted to string.
zh_cn: 此函数使用提供的分隔符连接一组参数，非字符串值将被转换为字符串。

source: This function joins the elements of an array using the provided delimiter, non-string values will be converted to string.
zh_cn: 此函数使用提供的分隔符连接数组的元素，非字符串值将被转换为字符串。

source: This function leaves the current game.
zh_cn: 此函数将退出当前游戏。

source: This function lets the instance take a step towards a particular position defined by xgoal/ygoal, all the while trying to avoid obstacles.
zh_cn: 此函数让实例朝着由 xgoal/ygoal 定义的特定位置迈出一步，同时试图避开障碍物。

source: This function lets you set the CSS style properties for the given button via the key/value pairs in the provided DS Map.
zh_cn: 此函数允许您通过提供的DS Map中的键/值对为给定的按钮设置CSS样式属性。

source: This function links an emitter to an audio bus.
zh_cn: 此函数将发射器链接到音频总线。

source: This function logs the user into appropriate leaderboard and achievement service.
zh_cn: 此函数将用户登录到适当的排行榜和成就服务。

source: This function logs the user out of the chosen leaderboard and achievement service.
zh_cn: 此函数会让用户退出所选的排行榜和成就服务。

source: This function moves the current read position within the file to the indicated position.
zh_cn: 此函数将文件中的当前读取位置移动到指定位置。

source: This function must be called after defining any new vertex format.
zh_cn: 此函数必须在定义任何新的顶点格式后被调用。

source: This function must be called before you can define any primitives.
zh_cn: 在定义任何图元之前，必须调用此函数。

source: This function must be called before you define the vertices of a textured primitive.
zh_cn: 在定义纹理图元的顶点之前，必须调用此函数。

source: This function must be called when you have finished defining the points of your primitive.
zh_cn: 在完成定义图元的点时，必须调用此函数。

source: This function must be called whenever you are finished using any created vector formats.
zh_cn: 每当您使用完任何已创建的矢量格式时，都必须调用此函数。

source: This function must be used to copy any sprites from the original assets before any transformations can be done on them.
zh_cn: 必须使用此函数从原始资源中复制任何精灵，然后才能对其进行任何变换。

source: This function must be used to create a new emitter and assign it to a given particle system.
zh_cn: 此函数必须用来创建一个新的发射器，并将其分配给一个给定的粒子系统。

source: This function must be used to remove a clickable icon previously created with clickable_add() from the game window.
zh_cn: 此函数必须用于从游戏窗口中删除之前用clickable_add()创建的可点击图标。

source: This function needs to be called before you add any fonts and setting it to true will enable AA, and setting it to false will disable it.
zh_cn: 在添加任何字体之前需要调用此函数，将其设置为true将启用AA，将其设置为false将禁用AA。
